# Sweep Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Sweep Class
Members See Also
---
A sweep solid or void form.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Sweep : GenericForm
```

Visual Basic
---
```text
Public Class Sweep _
	Inherits GenericForm
```

Visual C++
---
```text
public ref class Sweep : public GenericForm
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..CombinableElement Autodesk.Revit.DB..::..GenericForm Autodesk.Revit.DB..::..Sweep
# See Also
Sweep Members
Autodesk.Revit.DB Namespace